Repository: 3LITA/Memento
Catalog: app/i18n/*/LC_MESSAGES/messages.po
Languages: ru

source: Hi, *{}*! I am gonna help you learn everything you've always wanted, no matter how hard it is! But first, you must sign up.
ru: Привет, *{}*! Я помогу тебе выучить все, что ты захочешь, вне зависимости от сложности изучаемого! Но сперва, тебе нужно зарегистрироваться.

source: Excellent, *{username}*! Since you have signed up, you can create new decks!
ru: Отлично, *{username}*! Поскольку регистрация прошла успешно, можно создать новые колоды!

source: Welcome back, *{}*!
ru: Привет снова, *{}*!

source: Okay, *{username}*, please describe your issue, it will be forwarded to our support assistant
ru: Хорошо, *{username}*, пожалуйста, опиши свою проблему, и она будет направлена нашему ассистенту поддержки

source: Fine, *{username}*, your issue was sent to the support assistant: {issue_text}
ru: Здорово, *{username}*, текст проблемы был отправлен ассистенту поддержки: {issue_text}

source: %(menu_command)s - use this command to navigate
ru: %(menu_command)s - используй эту команду для навигации

source: Sorry, I don't understand this command
ru: Извини, я не знаю такой команды

source: Deck *{title}* was successfully created!
ru: Колода *{title}* была успешно создана!

source: The card was successfully deleted!
ru: Карта была успешно удалена!

source: The card is already deleted
ru: Карта уже удалена

source: Deck *{deck_title}* was successfully deleted!
ru: Колода *{deck_title}* была успешно удалена!

source: Deck *{previous_deck_title}* was renamed to *{new_deck_title}*.
ru: Колода *{previous_deck_title}* была переименована в *{new_deck_title}*.

source: Sorry, but I can't find this deck.
ru: Извини, но я не могу найти эту колоду.

source: Your decks:
ru: Твои колоды:

source: Please, estimate your knowledge level:
ru: Пожалуйста, оцени свои знания:

source: It's a start menu.
ru: Главное меню.

source: Do you want to create a new deck or add an existing one?
ru: Создать новую колоду или добавить существующую?

source: Send me a name to your deck. P.S. Remember that it should be unique.
ru: Пришли название будущей колоды. P.S. Учти, что оно должно быть уникальным.

source: Deck title is too long. Try to make it shorter.
ru: Название колоды слишком длинное. Попробуй его укоротить.

source: Deck title contains incorrect characters. Only latin letters, numbers and dash are allowed.
ru: Название колоды содержит некорректные символы. Только латинские буквы, цифры и дефис разрешено использовать в названии колоды.

source: Deck with title *{title}* already exists. Come up with another name.
ru: Колода с названием *{title}* уже существует. Придумай другое название.

source: Deck *{title}*
ru: Колода *{title}*

source: Deck *{title}* is empty
ru: Колода *{title}* пуста

source: Choose type of a card that you want to add to "*{}*". 0: a card with no answer, just some fact 1: a question-answer card 2: a card with gaps \_ that you need to fill 3: a card with multiple choice 4: a card with only one correct answer.
ru: Выбери тип карты которую хочешь добавить в "*{}*". 0: карта без ответа, просто факт 1: карта вопрос-ответ 2: карта с полями для ввода \_ 3: карта с множественным выбором 4: карта с выбором одного правильного ответа.

source: You chose card type *{}*. Send me a *question*, that should be on a card.
ru: Ты выбрал карту типа *{}*. Пришли *вопрос*, который будет на карте.

source: Remember that the question should contain gaps "*_*".
ru: Учти, что вопрос должен содержать поля для ввода "*_*".

source: Send me the *fact*, that should be on this card.
ru: Пришли *факт*, который будет на карте.

source: Your new card: {fact}
ru: Твоя новая карта: {fact}

source: Send me {number} comma-separated correct answers to this question: {question}
ru: Пришли мне {number} разделенных запятой правильных ответа(ов) на этот вопрос: {question}

source: Send me comma-separated correct answers to this question: {question}
ru: Пришли мне разделенные запятой правильные ответы на этот вопрос: {question}

source: Send me comma-separated wrong answers to this question: {question}
ru: Пришли мне разделенные запятой неправильные ответы на этот вопрос: {question}

source: Send me the correct answer to this question: {question}
ru: Пришли мне правильный ответ на этот вопрос: {question}

source: There are no correct answers.
ru: Правильных ответов нет.

source: There are no wrong answers.
ru: Неправильных ответов нет.

source: You are confusing me! Send me the correct answer to this question: {question}
ru: Ты меня смущаешь! Пришли мне правильный ответ на этот вопрос: {question}

source: You are confusing me! Send me comma-separated correct answers to this question: {question}
ru: Ты меня смущаешь! Пришли мне разделенные запятой правильные ответы на этот вопрос: {question}

source: You are confusing me! Send me comma-separated wrong answers to this question: {question}
ru: Ты меня смущаешь! Пришли мне разделенные запятой правильные ответы на этот вопрос: {question}

source: What do you want to change in this card? {question} {answers}
ru: Что ты хочешь изменить в этой карте? {question} {answers}

source: Do you want to change in this fact? {question}
ru: Что ты хочешь изменить в этом факте? {question}

source: What do you want to change in the deck *{deck_title}*?
ru: Что ты хочешь изменить в колоде *{deck_title}*?

source: Send me the name to the deck *{deck_title}*.
ru: Пришли мне новое название для колоды *{}*.

source: Are you sure you want to delete deck *{title}*?
ru: Удалить колоду *{title}*?

source: Correct answer:
ru: Правильный ответ:

source: Correct answers:
ru: Правильные ответы:

source: Wrong answers:
ru: Неправильные ответы:

source: Your choice:
ru: Твой выбор:

source: Correct!
ru: Правильно!

source: Absolutely correct!
ru: Совершенно верно!

source: Perfect!
ru: Отлично!

source: Well done!
ru: Именно так!

source: Excellent!
ru: Великолепно!

source: Wrong!
ru: Неправильно!

source: Bad news, wrong!
ru: К сожалению, ты ошибаешься!

source: Sorry, incorrect!
ru: Извини, но это неверный ответ!

source: Your question is too long. Try to make it shorter.
ru: Вопрос слишком длинный. Попробуй его укоротить.

source: The card of type {type} was successfully created: {question} Correct answers: {correct_answers}
ru: Карта типа {type} успешно создана: {question} Правильные ответы: {correct_answers}

source: The card of type {type} was successfully created: {question} Correct: {correct_answers} Wrong: {wrong_answers}
ru: Карта типа {type} была успешно создана: {question} Правильные: {correct_answers} Неправильные: {wrong_answers}

source: Sorry, but a card of type *2* should contain gaps "*_*"
ru: Извини, но карта типа *2* должна содержать поля для ввода "*_*"

source: Sorry, but I need {expected} answers, whereas you gave me {actual}.
ru: Прости, но мне необходимо {expected} ответов, а у тебя их {actual}.'

source: Choose the language you want to set
ru: Выбери язык

source: The language was successfully changed!
ru: Язык был успешно изменен!

source: Tip:
ru: Подсказка:

source: Unfortunately, there are no tips for this question... I can show you the answer though
ru: К сожалению, к этому вопросу нет подсказок... Однако, я могу показать правильный ответ

source: Unfortunately, the context of our dialogue is already forgotten...
ru: К сожалению, контекст нашего диалога уже забыт...

source: What do you mean?
ru: Что ты имеешь в виду?

source: Please type /help and get the available commands
ru: Советую ввести /help и посмотреть список доступных команд

source: Sorry, I can't understand
ru: К сожалению, я не понимаю о чём ты

source: Sorry, but I can't reply... But I can help you learn something!
ru: Прости, но я не могу поддержать диалог... Зато я могу предложить поучиться!

source: Sign up
ru: Зарегистрироваться

source: My decks
ru: Мои колоды

source: Add deck
ru: Добавить колоду

source: Question
ru: Вопрос

source: Correct
ru: Правильные

source: Wrong
ru: Неправильные

source: Delete
ru: Удалить

source: Cancel
ru: Отмена

source: Rename
ru: Переименовать

source: Back
ru: Назад

source: Add card
ru: Добавить карту

source: Learn
ru: Учить

source: Edit
ru: Редактировать

source: Tip
ru: Подсказка

source: Show answer
ru: Показать ответ

source: Submit
ru: Подтвердить

source: Change language
ru: Сменить язык

source: Support
ru: Поддержка

source: Create
ru: Создать

source: Add
ru: Добавить

source: No correct answers
ru: Правильных ответов нет

source: No wrong answers
ru: Неправильных ответов нет

source: The email {email} is already in use
ru: Адрес электронной почты {email} уже используется

source: No account was found with the email address {email}
ru: Аккаунт с адресом электронной почтты {email} не найден

source: The password is incorrect
ru: Неверный пароль

source: The username {username} contains incorrect characters, only latin letters and numbers are allowed
ru: Имя пользователя {username} содержит запрещенные символы, можно использовать только латинские буквы и цифры

source: The username {username} is already in use
ru: Имя пользователя {username} уже используется

source: Password must be at least 8 characters long, contain at least one digit, one uppercase and one lowercase latin letter
ru: Пароль должен быть длиной хотя бы 8 символов, содержать хотя бы одну цифру, одну заглавную и одну строчную латинскую букву

source: Well done! Now you can sign in using your credentials
ru: Отлично! Теперь ты можешь войти, используя данные для входа

source: An unexpected error happened. Please, try again later.
ru: Произошла неожиданная ошибка. Пожалуйста, попробуйте позже.
